app/views/admin/index.html.haml

      .span12
        -@category_hash[category.name][:featured_images].each do |image|
          .thumbnail
---
SELECT "images".* FROM "images" WHERE (category_id = 1 AND feature ='t')