app/controllers/admin_controller.rb

  def index
    @users = User.all
    @categories = Category.all

    @category_hash = {}

    @categories.each do |category|
      @category_hash[category.name] = {
        :image_count => category.images.count,
        :featured_images => Image.where("category_id = ? AND feature =?", category.id, true)
---
SELECT "users".* FROM "users"
SELECT "categories".* FROM "categories" WHERE (id = 1 AND feature ='t')
SELECT "images".* FROM "images" WHERE (category_id = 1 AND feature ='t')
SELECT COUNT(*) FROM "images" WHERE "images"."category_id" = 1