app/controllers/categories_controller.rb

INSERT INTO "categories" ("created_at", "description", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Thu, 27 Sep 2012 03:56:36 UTC +00:00], ["description", "Ashlee weddings"], ["name", "Weddings"], ["updated_at", Thu, 27 Sep 2012 03:56:36 UTC +00:00]]
---
  def create
    @category = Category.new(params[:category])

    respond_to do |format|
      if @category.save

SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    render :layout => 'application'
    @category = Category.find(params[:id])