app/controllers/images_controller.rb

  def create
    image = params[:image]
    @image = Image.new :title => image[:title], :category_id => Category.find_by_name(image[:category]), :caption => image[:caption], :feature => image[:feature]
    @count = Image.count + 1

    @file_name = to_lower_underscore "#{@count} #{image[:category]} #{image[:title]}"

    @image.aws_file_name = @file_name
    @image.url = "http://s3.amazonaws.com/#{current_bucket}/#{@file_name}"

    AWS::S3::S3Object.store(@file_name, open(image[:file]), current_bucket, :access => :public_read)

    respond_to do |format|
      if @image.save
---
SELECT "categories".* FROM "categories" WHERE "categories"."name" = 'Weddings' LIMIT 1
SELECT COUNT(*) FROM "images"
INSERT INTO "images" ("aws_file_name", "caption", "category_id", "created_at", "feature", "title", "updated_at", "url") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def edit
    @image = Image.find params[:id]
    @categories = Category.find(:all, :select => 'name').map(&:name)
---
SELECT "images".* FROM "images" WHERE "images"."id" = ? LIMIT 1  [["id", "7"]]
SELECT "categories".* FROM "categories" WHERE "categories"."id" = 1 LIMIT 1