app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "crypted_password", "name", "password_salt", "permissions", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save