app/views/images/_form.html.haml

SELECT "categories".* FROM "categories"
---
    =f.label :category
    =f.select :category, @categories