app/views/images/_properties.html.haml

SELECT name FROM "categories"
---
  =f.label :category
  =f.select :category, categories