app/views/images/edit.html.haml

SELECT name FROM "categories"
---
    =f.label :category
    =f.select :category, @categories